Repository: norcle/ligno_yield
Catalog: lib/l10n/app_*.arb
Languages: kk, ru, tg, uz

# menuCalculator
source: Calculator
kk: Калькулятор
ru: Калькулятор
tg: Ҳисобкунак
uz: Kalkulyator

# menuAbout
source: About the App
kk: Қосымша туралы
ru: О приложении
tg: Дар бораи барнома
uz: Ilova haqida

# menuContacts
source: Contacts / Support
kk: Байланыс / Қолдау
ru: Контакты / Поддержка
tg: Тамос / Дастгирӣ
uz: Kontaktlar / Yordam

# inputCrop
source: Crop
kk: Дақыл
ru: Культура
tg: Зироат
uz: Ekin

# inputSoilType
source: Soil type
kk: Топырақ түрі
ru: Тип почвы
tg: Навъи хок
uz: Tuproq turi

# inputStartDate
source: Vegetation start date
kk: Вегетация басталу күні
ru: Дата начала вегетации
tg: Санаи оғози нашъунамо
uz: Vegetatsiya boshlanish sanasi

# inputArea
source: Treated area (ha)
kk: Өңделген аумақ (га)
ru: Обрабатываемая площадь (га)
tg: Майдони коркард (га)
uz: Ishlov berilgan maydon (ga)

# inputAvgYieldLabel
source: Average yield (centner/ha)
ru: Средняя урожайность (ц/га)
tg: Ҳосили миёна (ц/га)

# inputPriceLabel
source: Planned price per 1 ton (RUB)
ru: Плановая цена за 1 т (руб.)
tg: Нархи нақшавӣ барои 1 тонна (RUB)

# inputSelectCropError
source: Select a crop
ru: Выберите культуру
tg: Зироатро интихоб кунед

# inputSelectSoilError
source: Select a soil type
ru: Выберите тип почвы
tg: Навъи хокро интихоб кунед

# inputSelectDateError
source: Select a start date
ru: Выберите дату начала
tg: Санаи оғозро интихоб кунед

# inputAreaRequiredError
source: Enter an area
ru: Введите площадь
tg: Майдони коркардро ворид кунед

# inputAreaMinError
source: Area must be greater than 0
ru: Площадь должна быть больше 0
tg: Майдон бояд аз 0 калон бошад

# actionCalculate
source: Calculate
kk: Есептеу
ru: Рассчитать
tg: Ҳисоб кардан
uz: Hisoblash

# actionContinue
source: Continue
kk: Жалғастыру
ru: Продолжить
tg: Идома додан
uz: Davom etish

# actionBack
source: Back
kk: Артқа
ru: Назад
tg: Баргашт
uz: Orqaga

# resultTitle
source: Result
kk: Нәтиже
ru: Результат
tg: Натиҷа
uz: Natija

# resultTreatedAreaLabel
source: Treated area: {area} ha
ru: Обрабатываемая площадь: {area} га
tg: Майдони коркард: {area} га

# resultApplicationsLabel
source: Applications
ru: Обработки
tg: Коркардҳо

# resultTotal
source: Total amount
kk: Жалпы мөлшер
ru: Итоговое количество
tg: Ҳамагӣ
uz: Jami miqdor

# phaseStartDateLabel
source: Start date: {date}
ru: Дата начала: {date}
tg: Санаи оғоз: {date}

# phaseDayLabel
source: Day {day}
kk: Күн {day}
ru: День {day}
tg: Рӯз {day}
uz: Kun {day}
